---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.TurnCropRegionOffRemovesViewBreaks
source: html/06d57407-0472-25b4-a5ba-e55180a8dbfb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.TurnCropRegionOffRemovesViewBreaks Property

Turning off the Crop Region of the view will remove all View Breaks. If the Crop Region is turned on at a later time,
 any desired View Breaks must be created again.

## Syntax (C#)
```csharp
public static FailureDefinitionId TurnCropRegionOffRemovesViewBreaks { get; }
```